---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Edge Properties
Edge Class See Also Send Feedback
---

The Edge type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ApproximateLength | Returns the approximate length of the edge. |
|  | GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle (Inherited from GeometryObject.) |
|  | Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement. (Inherited from GeometryObject.) |
|  | IsElementGeometry | Indicates whether this geometry is obtained directly from an Element. (Inherited from GeometryObject.) |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
|  | Reference | Returns a stable reference to the edge. |
|  | Visibility | The visibility. (Inherited from GeometryObject.) |

# See Also

Edge Class

Autodesk.Revit.DB Namespace